Revit 2027 API
ProjectBrowserOptions.AutoExpandSheetViewsOnViewPlacement Property
 Auto expand sheet views on view placement.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AutoExpandSheetViewsOnViewPlacement { get; set; }
Public Property AutoExpandSheetViewsOnViewPlacement As Boolean
	Get
	Set
public:
property bool AutoExpandSheetViewsOnViewPlacement {
	bool get ();
	void set (bool value);
}
member AutoExpandSheetViewsOnViewPlacement : bool with get, set
Property Value
Boolean
Remarks
 If true, the sheet view will be expanded when place a view on to it in the Project Browser. If false, the sheet view will not be expanded when place a view on to it in the Project Browser.
See Also
Reference
ProjectBrowserOptions Class
Autodesk.Revit.UI Namespace